import numpy as np

heart_rate = np.array([72, 75, 71, 80, 78, 74])
print(heart_rate)

# np.mean()
# np.median()
# np.std()
# np.var()
# np.min()
# np.max()
# np.percentile()

# mean_hr = np.mean(heart_rate)
# median_hr = np.median(heart_rate)
# std_hr = np.std(heart_rate)

# Для кожного пацієнта відомі результати вимірювання:
# частоти серцевих скорочень — HR, уд/хв;
# систолічного артеріального тиску — SBP, мм рт. ст.;
# діастолічного артеріального тиску — DBP, мм рт. ст.;
# температури тіла — Temperature, °C;
# сатурації крові — SpO₂, %.

# Необхідно представити ці дані у вигляді багатовимірного масиву NumPy, виконати математичний та статистичний аналіз і сформувати підсумковий звіт.

data = np.array([
    [72, 120, 80, 36.6, 98],
    [85, 135, 88, 37.1, 97],
    [68, 110, 72, 36.5, 99],
    [95, 145, 92, 37.4, 95],
    [76, 125, 82, 36.8, 98],
    [110, 155, 96, 38.0, 93],
    [64, 105, 68, 36.4, 99],
    [88, 130, 85, 37.0, 97],
    [102, 150, 94, 37.6, 94],
    [74, 118, 78, 36.7, 98]
])









